Tekla.Structures.Drawing.CurvedDimensionSetHandler
The CurvedDimensionSetHandler class contains operations for creating curved dimension sets.

Tekla.Structures.Drawing.CurvedDimensionSetHandler.CreateCurvedDimensionSetRadial(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PointList,System.Double,Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
Creates a curved dimension set from the specified points and inserts it to the database.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
DimensionPoints: The dimension points to be used.
Distance: The distance to be used.
Attributes: The attributes to be used.
Returns: The created dimension set or null if failed.

Tekla.Structures.Drawing.CurvedDimensionSetHandler.CreateCurvedDimensionSetRadial(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PointList,System.Double)
Creates a curved dimension set from the specified points and inserts it to the database.
Uses the default attributes.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
DimensionPoints: The dimension points to be used.
Distance: The distance to be used.
Returns: The created dimension set or null if failed.

Tekla.Structures.Drawing.CurvedDimensionSetHandler.CreateCurvedDimensionSetOrthogonal(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PointList,System.Double,Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
Creates a curved dimension set with orthogonal reference lines
from the specified points and inserts it to the database.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
DimensionPoints: The dimension points to be used.
Distance: The distance to be used.
Attributes: The attributes to be used.
Returns: The created dimension set or null if failed.

Tekla.Structures.Drawing.CurvedDimensionSetHandler.CreateCurvedDimensionSetOrthogonal(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PointList,System.Double)
Creates a curved dimension set with orthogonal reference lines
from the specified points and inserts it to the database.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
DimensionPoints: The dimension points to be used.
Distance: The distance to be used.
Returns: The created dimension set or null if failed.